---
type: SpotDimension
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# SpotDimension

`Autodesk.Revit.DB.SpotDimension` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | CanFlip | 2021.2 | `public bool CanFlip ()` |
| Method | Flip | 2021.2 | `public void Flip ()` |
| Property | LeaderHasShoulder | 2021.1 | `public bool LeaderHasShoulder { get ; set ; }` |
| Property | LeaderShoulderPosition | 2021.1 | `public XYZ LeaderShoulderPosition { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | SpotDimensionType | — | `public SpotDimensionType SpotDimensionType { get ; set ; }` |